{"keras_version": "2.0.3", "backend": "tensorflow", "config": [{"config": {"trainable": true, "dtype": "int32", "input_length": 60, "name": "embedding_1", "batch_input_shape": [null, 60], "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_dim": 76, "activity_regularizer": null, "mask_zero": false, "output_dim": 5, "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_1", "trainable": true, "layer": {"config": {"trainable": true, "unit_forget_bias": true, "recurrent_dropout": 0.1, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "units": 256, "implementation": 0, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_regularizer": null, "unroll": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.1, "use_bias": true, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "bidirectional_2", "trainable": true, "layer": {"config": {"trainable": true, "unit_forget_bias": true, "recurrent_dropout": 0.1, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "units": 256, "implementation": 0, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_regularizer": null, "unroll": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.1, "use_bias": true, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "bidirectional_3", "trainable": true, "layer": {"config": {"trainable": true, "unit_forget_bias": true, "recurrent_dropout": 0.25, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "units": 128, "implementation": 0, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_regularizer": null, "unroll": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.25, "use_bias": true, "kernel_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"trainable": true, "units": 36, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, "dtype": "float32", "batch_input_shape": [null, 60, 128]}, "class_name": "TimeDistributed"}], "class_name": "Sequential"}